{
  "name": "Simran Manturgimath",
  "title": "Software Developer",
  "email": "simran.rm6@gmail.com",
  "phone": "+1 (703)-389-7074",
  "experience": [
    {
      "title": "Graduate Professional Assistant",
      "company": "George Mason University",
      "date": "Jan 2023 - Jun 2023",
      "responsibilities": [
        "🚀 Mission: ",
        "-  Engage with prospective graduate students to facilitate their transition into the College of Engineering and Computing, promoting key programs and events.",
        "🔍 My Role:",
        "- Collected, organized, and prepared inquiry/applicant data and RSVP/attendance data for events using TargetX Salesforce, ensuring data accuracy for recruitment campaigns.",
        "- Created and managed event invitation campaigns for recruitment-related activities, including information sessions, admissions fairs, and outreach for the Bachelor's/Accelerated Master's (BAM) programs.",
        "- Conducted individual and small group outreach to international students via virtual platforms like gradED Community, increasing engagement and awareness of the programs.",
        "✨ What We Achieved:",
        "- Enhanced event participation and applicant outreach efforts, contributing to increased awareness and enrollment in the College's programs.",
        "- Streamlined data management processes, ensuring that recruitment events ran smoothly and that prospective students received timely information."
      ]
    },
    {
      "title": "Software Developer",
      "company": "GB Ventures",
      "date": "Mar 2019 - May 2021",
      "responsibilities": [
        "🚀 Mission: ",
        "-To digitalize property management in India and empower real estate professionals with cutting-edge technology.",
        "🔍 My Role:",
        "- Backend Development: Designed and developed RESTful APIs using Node.js and Express, seamlessly integrating MongoDB to handle large datasets and ensure high performance.",
        "- Frontend Development: Built an intuitive React interface, optimizing user navigation and increasing engagement by 25%.",
        "- Cloud Optimization: Implemented AWS CloudWatch for proactive system monitoring, reducing downtime by 40% and ensuring high availability.",
        "- Automation: Automated the CI/CD pipeline with Jenkins and AWS services, accelerating deployment times and cutting errors by 50%.",
        "✨ What We Achieved:",
        "- Increased property manager productivity by 25%, enabling more strategic focus on business growth.",
        "- Enhanced tenant satisfaction through transparency and improved system reliability.",
        "- Achieved 80% unit test coverage, ensuring high-quality, maintainable code."
      ]
    },
    {
      "title": "Web Developer Intern",
      "company": "Cubiccode Digital Media LLP",
      "date": "Jan 2019 - Feb 2019",
      "responsibilities": [
        "🚀 Mission: ",
        "- Designed and developed a visually appealing website for a bakery, enhancing its digital presence and customer interaction.",
        "🔍 My Role:",
        "- Developed a responsive website using HTML, CSS, and JavaScript, ensuring smooth user experience across devices.",
        "- Integrated a Drupal-based content management system, allowing the bakery to manage product updates and promotions easily.",
        "✨ What We Achieved:",
        "- Boosted customer engagement and sales, significantly enhancing the bakery’s online presence.",
        "- Delivered a scalable platform that could easily grow with the business."
      ]
    }
  ],
  "education": [
    {
      "degree": "Masters Computer Science | George Mason University",
      "school": "Fairfax, Virginia",
      "date": "Aug 2021 - May 2023",
      "courses": "Analysis of Algorithms, Data Mining, Information and Network Security, Software Specifications and Constructions, System Programming, Machine Learning, Component Based Software Development, Advanced NLP."
    },
    {
      "degree": "Bachelors, Computer Science | KLE MSSCET",
      "school": "Belgaum, India",
      "date": "Jul 2015 - Jul 2019",
      "courses": "Operating Systems, Cloud Computing, Software testing, Object Oriented Programming, Data Structures, DBMS, System programming, Computer Organizations, Unix, Computer Graphics, Microprocessors, Data Communications, Cryptography & Network Security. "
    }
  ],
  "skills": {
    "Languages": ["Javascript", "Typescript", "Python", "Java"],
    "Web Technologies": ["HTML/CSS", "ReactJS", "NodeJS", "Express"],
    "Databases": ["NoSQL", "SQL", "MongoDB", "PostgreSQL"],
    "Cloud": ["AWS (Lambda, S3, EC2, CloudFront)", "Kubernetes"]
  }
}
